:PROPERTIES:
:ID:       80e7c641-792b-4d55-a905-0da56d28e46c
:END:
#+TITLE: TPM: Using swtpm
#+CATEGORY: slips
#+TAGS:

#+begin_quote
I just realized that without the CUSE build of =swtpm=, unfortunately, interaction
with a character device will likely require =root=, even though the device is a
software implementation. So, without that capability (or root), you're limited
to Unix socket and TCP/IP socket.
#+end_quote

** Config

Use something like [[https://github.com/stefanberger/swtpm/blob/master/samples/swtpm-create-user-config-files.in][./samples/swtpm-create-user-config-files.in]] to genreate config

#+begin_src shell :results output
cat <<EOF | tree -a --fromfile .
/etc/swtpm-localca.conf
/etc/swtpm_setup.conf
/home/user/.config/swtpm-localca.conf
/home/user/.config/swtpm_setup.conf
EOF
#+end_src

#+RESULTS:
#+begin_example
.
├── etc
│   ├── swtpm-localca.conf
│   └── swtpm_setup.conf
└── home
    └── user
        └── .config
            ├── swtpm-localca.conf
            └── swtpm_setup.conf

5 directories, 4 files
#+end_example

